.back-to-markdown/2015/05/links.org.markdown
Useful Links
============

**WARNING: This is old and likely obsolete.**

-   Time-stamp: \<2020-03-23 04:39:53 tamara\>

Just a few links. I don\'t know if this is a good collection anymore. I also don\'t know why these aren\'t just regular posts.

CSS
---

-   [Autoprefixer](https://css-tricks.com/autoprefixer/) [(GitHub)](https://github.com/postcss/autoprefixer) is a CSS post-processor that automatically adds CSS vendor prefixes and fixes the CSS to work in many browser versions that don\'t yet have full support for CSS features. See also \"Can I Use\" below.

-   [Can I Use](http://caniuse.com/) shows which browsers support which features.

-   [Flexbox in 5 minutes](http://flexboxin5.com/) is a nice application that introduces the CSS flexbox feature. See also: [A Complete Guide to Flexbox](https://css-tricks.com/snippets/css/a-guide-to-flexbox/).

-   [CSS-Tricks Blog](https://css-tricks.com/) is a great site for learning about nify CSS stuff.

Databases
---------

-   [Constructing a less than simple query with rails and arel](http://blog.donwilson.net/2011/11/constructing-a-less-than-simple-query-with-rails-and-arel/) This is from back in 2011, so is probably out of date, but still contains some fascinating use of AREL instead of writing straight SQL.

-   [The definitive guide to Arel, the SQL manager for Ruby](http://jpospisil.com/2014/06/16/the-definitive-guide-to-arel-the-sql-manager-for-ruby.html) This is more recent, still talking about using [AREL](https://github.com/rails/arel) but in much more depth.

-   [Dont Let Your Data Out of the Database - Pat Shaughnessy](http://patshaughnessy.net/2015/6/18/dont-let-your-data-out-of-the-database)

Design
------

-   [6 Steps to Perfecting Minimalism in Web Design](http://www.webdesignerdepot.com/2014/06/6-steps-to-perfecting-minimalism-in-web-design/) with a great example site by [Brian Danahar](http://www.briandanaher.com/).

Docker
------

-   [Getting Started with Compose and Rails](http://docs.docker.com/compose/rails/)

-   [Optimizing your Dockerfiles](http://tech.paulcz.net/2015/03/optimizing-your-dockerfiles/)

-   [Rails on Docker (via Thoughtbot)](http://robots.thoughtbot.com/rails-on-docker)

-   [Rails Development Using Docker and Vagrant (Abe Voelker)](https://blog.abevoelker.com/rails-development-using-docker-and-vagrant/)

-   [How to Create a Persistent Ruby Gems Container with Docker By Phil Misiowiec](http://www.atlashealth.com/blog/2014/09/persistent-ruby-gems-docker-container/#.VRq0d5NjOfg)

-   [Docker and Microservices](http://blog.giantswarm.io/getting-started-with-microservices-using-ruby-on-rails-and-docker)

-   [A Productive Development Environment with Docker on OS/X](http://www.ybrikman.com/writing/2015/05/19/docker-osx-dev/) A good write-up on using docker in rails development.

Emacs
-----

-   Jekor\'s Emacs Tutorials: <https://www.youtube.com/playlist?list=PLxj9UAX4Em-IiOfvF2Qs742LxEK4owSkr>

    Super set of videos showing the basics of using Emacs. Very good for visual learners new to Emacs.

-   [Mastering Emacs](https://www.masteringemacs.org/) web site and now e-book by Emacs master Mickey Petersen [twitter](http://twitter.com/mickeynp). Blog posts about using Emacs\'s more advanced and powerful features.

Javascript
----------

-   [You Don\'t Know JS](https://github.com/getify/You-Dont-Know-JS) Kyle Simpson\'s tour de force on JavaScript in online form.

-   [Javascript Abstract Equality Comparison Algorithm](http://www.ecma-international.org/ecma-262/5.1/#sec-11.9.3)

-   [Writing Idiomatic Javascript](https://github.com/rwaldron/idiomatic.js)

### Angular

-   [Opinionated Style Guide](https://github.com/johnpapa/angular-styleguide) by [John Papa](http://johnpapa.net/) [(twitter)](https://twitter.com/john_papa)

### Aurelia.IO

-   [aurelia.io](http://aurelia.io/) - a newish (April 2015) JS client framework using pretty simple convention over configuration to speed up SPA development. [Durandel.JS](http://durandaljs.com/) is the previous generation of aurelia.

### React.JS

-   [React.JS and Rails](https://www.airpair.com/reactjs/posts/reactjs-a-guide-for-rails-developers) by [Fernando Villalobos](https://github.com/fervisa). A really clear tutorial for using React.JS with Rails, including [sample code](https://github.com/fervisa/accounts-react-rails) [(my fork)](https://github.com/tamouse/accounts-react-rails).

Jekyll
------

-   [Introducing Jekyll-hook: Run your own GitHub Pages --- Development Seed](https://developmentseed.org/blog/2013/05/01/introducing-jekyll-hook/)
-   [Prose · A Content Editor for GitHub](http://prose.io/), [prose/prose](https://github.com/prose/prose)
-   [Build websites in HTML or Jekyll. Have your non-technical team update inline - CloudCannon](http://cloudcannon.com/)

Rails
-----

-   [Enumerated Types with ActiveRecord and PostgreSQL](http://www.sitepoint.com/enumerated-types-with-activerecord-and-postgresql/?utm_source=rubyweekly&utm_medium=email)

-   [Rails Application Templates in the Real World](http://www.sitepoint.com/rails-application-templates-real-world) Template All The Things!! [My Rails App Template](https://gist.github.com/tamouse/bd7438f7722ae1d6b314)

-   [A list of reserved words in Rails](http://bparanj.blogspot.ie/2011/07/reserved-words-in-rails.html)

-   [Adam Niedzeilski: 10 easy-to-fix Ruby / Ruby on Rails mistakes](http://adamniedzielski.github.io/blog/2015/01/31/11-easy-to-fix-ruby-slash-ruby-on-rails-mistakes/)

-   [Definitive Guide to Forms-based Authentication](http://stackoverflow.com/questions/549/the-definitive-guide-to-forms-based-website-authentication)

-   [Data Driven Controllers](http://spin.atomicobject.com/2015/01/26/data-driven-rails-controllers/)

-   [Page-specific Javascript in Rails](http://brandonhilkert.com/blog/page-specific-javascript-in-rails/)

-   [Rails Testing Antipatterns talk](https://speakerdeck.com/kfaustino/rails-testing-antipatterns)

-   [How to preload Rails scopes - Justin Weiss](http://www.justinweiss.com/articles/how-to-preload-rails-scopes/)

Ruby
----

-   [Forwardable Deep Dive](http://www.saturnflyer.com/blog/jim/2015/01/20/ruby-forwardable-deep-dive/)

-   [New Methods in Ruby 2.2](http://www.sitepoint.com/new-methods-ruby-2-2/)

-   [Just use double quoted strings](http://viget.com/extend/just-use-double-quoted-ruby-strings)

-   [Whats youre favorite ruby trick or quirk that most people dont know about. ruby](https://www.reddit.com/r/ruby/comments/29hr4x/whats_youre_favorite_ruby_trick_or_quirk_that/)

-   [Docker support in RubyMine](http://plugins.jetbrains.com/update/index?pr=ruby&updateId=19837)

Shell, Command Line, Bash, etc.
-------------------------------

-   [Learn Enough Command Line To Be Dangerous](http://www.learnenough.com/command-line-tutorial) -- by Michael Hartl of RailsTutorial fame.

Testing
-------

-   Randy Coulman has written a [series on testing](http://randycoulman.com/blog/categories/getting-testy/) that I think you\'ll find useful.

Tools
-----

### Version Control, Git, etc

-   [Telling stories with your Git history - FutureLearn](https://about.futurelearn.com/blog/telling-stories-with-your-git-history/)

-   [The Importance of Writing Good Commit Messages](https://about.futurelearn.com/blog/a-commit-message-from-our-repo-2/) -- a follow-up to the previous link.
